open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_jpeg_encoder.c
/****************************************************************************
 * chips/bk7258/ap/bk7258_jpeg_encoder.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * BK7258 AP JPEG encoder typed helper.  The immutable v3.1.1.9 AP bundle
 * exports the low-level JPEG encoder, YUV buffer and DMA APIs from
 * libdriver.a.  It does not export the SDK's higher-level controller object,
 * so this file keeps the board-facing contract explicit and synchronous.
 ****************************************************************************/

#include <nuttx/config.h>

#include <errno.h>
#include <limits.h>
#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include <nuttx/compiler.h>
#include <nuttx/clock.h>
#include <nuttx/mutex.h>
#include <nuttx/semaphore.h>
#include <nuttx/spinlock.h>
#include <nuttx/wqueue.h>

#include <common/bk_err.h>
#include <driver/dma.h>
#include <driver/jpeg_enc.h>
#include <driver/yuv_buf.h>

#include <arch/chip/bk7258_jpeg_encoder.h>
#include "bk7258_media_root.h"

#define BK7258_JPEG_ENCODER_FLEXA_LINES       8u
#define BK7258_JPEG_ENCODER_PIXEL_BYTES       2u
#define BK7258_JPEG_ENCODER_DMA_BYTES         (10u * 1024u)
#define BK7258_JPEG_ENCODER_DMA_CHANNEL       DMA_ID_8
#define BK7258_JPEG_ENCODER_TIMEOUT_TICKS     SEC2TICK(5)

/* v3.1.1.9 jpeg_driver.c enables the source in the CPU1 interrupt register,
 * while the generic SMP route may retain the old CPU2 target.  The public
 * sys_driver header is not in the immutable bundle, so these are the minimal
 * declarations and the verified BK7258 v3.1.1.9 values.  The disable API
 * returns the previous enable register, not a zero-on-success errno. */

extern int32_t sys_drv_core_intr_group1_enable(uint32_t core_id,
                                               uint32_t param);
extern int32_t sys_drv_core_intr_group1_disable(uint32_t core_id,
                                                uint32_t param);

#define BK7258_JPEGENC_CPU1_CORE_ID           1u
#define BK7258_JPEGENC_CPU2_CORE_ID           2u
#define BK7258_JPEGENC_INTERRUPT_CTRL_BIT     (1u << 25)

struct bk7258_jpeg_encoder_s
{
  mutex_t api_lock;
  spinlock_t state_lock;
  sem_t complete_sem;
  struct work_s line_work;
  struct work_s complete_work;

  FAR uint8_t *line_cache;
  uint32_t line_cache_size;
  uint16_t width;
  uint16_t height;
  yuv_format_t format;

  dma_id_t dma;
  bool dma_ready;
  bool jpeg_ready;
  bool yuv_ready;
  bool callbacks_ready;
  bool route_ready;
  bool dma_started;

  bool initialized;
  bool faulted;
  volatile bool operation_active;
  volatile bool completion_queued;
  volatile bool completion_done;
  volatile bool head_pending;
  volatile uint32_t pending_lines;
  volatile uint32_t next_block;
  volatile int callback_result;
  volatile int completion_result;

  FAR const uint8_t *input;
  uint32_t input_length;
  FAR uint8_t *output;
  uint32_t output_capacity;
  uint32_t block_bytes;
  uint32_t block_count;
};

static struct bk7258_jpeg_encoder_s g_bk7258_jpeg_encoder =
{
  .api_lock = NXMUTEX_INITIALIZER,
  .complete_sem = SEM_INITIALIZER(0),
};

static void bk7258_jpeg_encoder_line_worker(void *arg);
static void bk7258_jpeg_encoder_complete_worker(void *arg);
static void bk7258_jpeg_encoder_head_callback(jpeg_unit_t id, void *param);

static int bk7258_jpeg_encoder_sdk_error(bk_err_t error)
{
  switch (error)
    {
      case BK_OK:
        return 0;

      case BK_ERR_PARAM:
      case BK_ERR_NULL_PARAM:
        return -EINVAL;

      case BK_ERR_NO_MEM:
        return -ENOMEM;

      case BK_ERR_TIMEOUT:
        return -ETIMEDOUT;

      case BK_ERR_BUSY:
      case BK_ERR_IN_PROGRESS:
        return -EBUSY;

      case BK_ERR_NOT_INIT:
      case BK_ERR_JPEG_NOT_INIT:
      case BK_ERR_YUV_BUF_DRIVER_NOT_INIT:
      case BK_ERR_DMA_NOT_INIT:
      case BK_ERR_DMA_ID_NOT_INIT:
        return -ENODEV;

      case BK_ERR_NOT_SUPPORT:
        return -ENOTSUP;

      case BK_ERR_NO_DEV:
        return -ENODEV;

      case BK_FAIL:
      default:
        return -EIO;
    }
}

static int bk7258_jpeg_encoder_check_handle(
  FAR struct bk7258_jpeg_encoder_s *priv)
{
  if (priv != &g_bk7258_jpeg_encoder)
    {
      return -EINVAL;
    }

  if (!priv->initialized)
    {
      return -ENODEV;
    }

  if (priv->faulted)
    {
      return -EIO;
    }

  return 0;
}

static int bk7258_jpeg_encoder_validate_range(FAR const void *data,
                                              uint32_t length,
                                              bool exclusive_end)
{
  uint64_t base;
  uint64_t last;
  uint64_t end;

  if (data == NULL || length == 0)
    {
      return -EINVAL;
    }

  base = (uint64_t)(uintptr_t)data;
  if (base > UINT64_MAX - length)
    {
      return -EOVERFLOW;
    }

  last = base + length - 1;
  end = base + length;
  if (last > UINT32_MAX || (exclusive_end && end > UINT32_MAX))
    {
      return -EOVERFLOW;
    }

  return 0;
}

static bool bk7258_jpeg_encoder_overlap(FAR const void *a,
                                         uint32_t a_len,
                                         FAR const void *b,
                                         uint32_t b_len)
{
  uintptr_t a_start = (uintptr_t)a;
  uintptr_t b_start = (uintptr_t)b;
  uintptr_t a_end;
  uintptr_t b_end;

  if (a_start > UINTPTR_MAX - a_len || b_start > UINTPTR_MAX - b_len)
    {
      return true;
    }

  a_end = a_start + a_len;
  b_end = b_start + b_len;
  return a_start < b_end && b_start < a_end;
}

static int bk7258_jpeg_encoder_route_to_cpu1(void)
{
  int ret;

  (void)sys_drv_core_intr_group1_disable(BK7258_JPEGENC_CPU2_CORE_ID,
                                         BK7258_JPEGENC_INTERRUPT_CTRL_BIT);

  ret = sys_drv_core_intr_group1_enable(BK7258_JPEGENC_CPU1_CORE_ID,
                                        BK7258_JPEGENC_INTERRUPT_CTRL_BIT);
  if (ret != 0)
    {
      (void)sys_drv_core_intr_group1_disable(
        BK7258_JPEGENC_CPU1_CORE_ID, BK7258_JPEGENC_INTERRUPT_CTRL_BIT);
      return -EIO;
    }

  return 0;
}

