open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_jpeg_encoder.c
static void bk7258_jpeg_encoder_route_from_cpu1(void)
{
  (void)sys_drv_core_intr_group1_disable(BK7258_JPEGENC_CPU1_CORE_ID,
                                         BK7258_JPEGENC_INTERRUPT_CTRL_BIT);
}

static bool bk7258_jpeg_encoder_active(FAR struct bk7258_jpeg_encoder_s *priv)
{
  irqstate_t flags;
  bool active;

  flags = spin_lock_irqsave(&priv->state_lock);
  active = priv->operation_active;
  spin_unlock_irqrestore(&priv->state_lock, flags);
  return active;
}

static void bk7258_jpeg_encoder_fail_from_callback(
  FAR struct bk7258_jpeg_encoder_s *priv, int error)
{
  irqstate_t flags;

  flags = spin_lock_irqsave(&priv->state_lock);
  if (priv->callback_result == 0)
    {
      priv->callback_result = error;
    }
  spin_unlock_irqrestore(&priv->state_lock, flags);
}

static int bk7258_jpeg_encoder_schedule_complete(
  FAR struct bk7258_jpeg_encoder_s *priv)
{
  irqstate_t flags;
  bool queue;
  int ret;

  flags = spin_lock_irqsave(&priv->state_lock);
  queue = priv->operation_active && !priv->completion_queued;
  if (queue)
    {
      priv->completion_queued = true;
    }
  spin_unlock_irqrestore(&priv->state_lock, flags);

  if (!queue)
    {
      return 0;
    }

  ret = work_queue(HPWORK, &priv->complete_work,
                   (worker_t)bk7258_jpeg_encoder_complete_worker,
                   priv, 0);
  if (ret < 0)
    {
      /* A callback cannot perform the blocking hardware cleanup.  Wake the
       * synchronous caller, which owns the fallback stop path. */
      flags = spin_lock_irqsave(&priv->state_lock);
      priv->completion_queued = false;
      priv->completion_result = -EIO;
      spin_unlock_irqrestore(&priv->state_lock, flags);
      (void)nxsem_post(&priv->complete_sem);
    }

  return ret;
}

static void bk7258_jpeg_encoder_line_callback(jpeg_unit_t id, void *param)
{
  FAR struct bk7258_jpeg_encoder_s *priv = param;
  irqstate_t flags;
  bool queue;
  int ret;

  (void)id;
  if (priv == NULL)
    {
      return;
    }

  flags = spin_lock_irqsave(&priv->state_lock);
  queue = priv->operation_active && priv->callback_result == 0;
  if (queue)
    {
      if (priv->pending_lines != UINT32_MAX)
        {
          priv->pending_lines++;
        }
      else
        {
          queue = false;
          priv->callback_result = -EOVERFLOW;
        }
    }
  spin_unlock_irqrestore(&priv->state_lock, flags);

  if (!queue)
    {
      (void)bk7258_jpeg_encoder_schedule_complete(priv);
      return;
    }

  ret = work_queue(HPWORK, &priv->line_work,
                   (worker_t)bk7258_jpeg_encoder_line_worker, priv, 0);
  if (ret < 0 && ret != -EBUSY)
    {
      bk7258_jpeg_encoder_fail_from_callback(priv, -EIO);
      (void)bk7258_jpeg_encoder_schedule_complete(priv);
    }
}

static void bk7258_jpeg_encoder_head_callback(jpeg_unit_t id, void *param)
{
  FAR struct bk7258_jpeg_encoder_s *priv = param;
  irqstate_t flags;
  int ret;

  (void)id;
  if (priv == NULL)
    {
      return;
    }

  flags = spin_lock_irqsave(&priv->state_lock);
  if (priv->operation_active && priv->callback_result == 0)
    {
      priv->head_pending = true;
    }
  else
    {
      spin_unlock_irqrestore(&priv->state_lock, flags);
      return;
    }
  spin_unlock_irqrestore(&priv->state_lock, flags);

  /* The official controller calls bk_yuv_buf_rencode_start() from this ISR.
   * Defer it to the existing HPWORK bridge so this wrapper keeps all SDK
   * calls out of the vendor callback context. */
  ret = work_queue(HPWORK, &priv->line_work,
                   (worker_t)bk7258_jpeg_encoder_line_worker, priv, 0);
  if (ret < 0 && ret != -EBUSY)
    {
      bk7258_jpeg_encoder_fail_from_callback(priv, -EIO);
      (void)bk7258_jpeg_encoder_schedule_complete(priv);
    }
}

static void bk7258_jpeg_encoder_eof_callback(jpeg_unit_t id, void *param)
{
  FAR struct bk7258_jpeg_encoder_s *priv = param;

  (void)id;
  if (priv != NULL)
    {
      (void)bk7258_jpeg_encoder_schedule_complete(priv);
    }
}

static void bk7258_jpeg_encoder_error_callback(jpeg_unit_t id, void *param)
{
  FAR struct bk7258_jpeg_encoder_s *priv = param;

  (void)id;
  if (priv != NULL)
    {
      bk7258_jpeg_encoder_fail_from_callback(priv, -EIO);
      (void)bk7258_jpeg_encoder_schedule_complete(priv);
    }
}

static void bk7258_jpeg_encoder_line_worker(void *arg)
{
  FAR struct bk7258_jpeg_encoder_s *priv = arg;
  irqstate_t flags;
  bool requeue;

  for (;;)
    {
      uint32_t block;
      bool head;
      FAR const uint8_t *src;
      FAR uint8_t *dst;
      bk_err_t sdkret;

      flags = spin_lock_irqsave(&priv->state_lock);
      if (!priv->operation_active ||
          (!priv->head_pending && priv->pending_lines == 0))
        {
          spin_unlock_irqrestore(&priv->state_lock, flags);
          break;
        }

      head = priv->head_pending;
      if (head)
        {
          priv->head_pending = false;
          block = 0;
        }
      else
        {
          priv->pending_lines--;
          block = priv->next_block++;
        }
      spin_unlock_irqrestore(&priv->state_lock, flags);

      if (head)
        {
          sdkret = bk_yuv_buf_rencode_start();
          if (sdkret != BK_OK)
            {
              bk7258_jpeg_encoder_fail_from_callback(priv,
                bk7258_jpeg_encoder_sdk_error(sdkret));
              (void)bk7258_jpeg_encoder_schedule_complete(priv);
              break;
            }
          continue;
        }

      if (block < priv->block_count)
        {
          src = priv->input + (size_t)block * priv->block_bytes;
          dst = priv->line_cache + (block & 1u) * priv->block_bytes;
          memcpy(dst, src, priv->block_bytes);
        }

      if (!bk7258_jpeg_encoder_active(priv))
        {
          break;
        }

      /* The line-clear interrupt releases the next already-buffered
       * 8-line block.  Even when there is no later block to refill, the
       * final buffered block still needs one re-encode trigger before JPEG
       * can raise EOF. */

