open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_jpeg_encoder.c
      if (block > priv->block_count)
        {
          continue;
        }

      sdkret = bk_yuv_buf_rencode_start();
      if (sdkret != BK_OK)
        {
          bk7258_jpeg_encoder_fail_from_callback(priv,
            bk7258_jpeg_encoder_sdk_error(sdkret));
          (void)bk7258_jpeg_encoder_schedule_complete(priv);
          break;
        }
    }

  /* A callback can arrive while this worker is draining.  Requeue after the
   * final check so an EBUSY result from that callback cannot lose a line. */
  flags = spin_lock_irqsave(&priv->state_lock);
  requeue = priv->operation_active &&
            (priv->head_pending || priv->pending_lines != 0);
  spin_unlock_irqrestore(&priv->state_lock, flags);
  if (requeue)
    {
      (void)work_queue(HPWORK, &priv->line_work,
                       (worker_t)bk7258_jpeg_encoder_line_worker, priv, 0);
    }
}

static void bk7258_jpeg_encoder_complete_worker(void *arg)
{
  FAR struct bk7258_jpeg_encoder_s *priv = arg;
  irqstate_t flags;
  uint32_t frame_size = 0;
  int result = 0;
  int callback_result;
  bk_err_t sdkret;

  if (!bk7258_jpeg_encoder_active(priv))
    {
      return;
    }

  sdkret = bk_yuv_buf_stop(JPEG_MODE);
  if (sdkret != BK_OK)
    {
      result = bk7258_jpeg_encoder_sdk_error(sdkret);
    }

  sdkret = bk_yuv_buf_soft_reset();
  if (sdkret != BK_OK && result == 0)
    {
      result = bk7258_jpeg_encoder_sdk_error(sdkret);
    }

  if (priv->dma_ready)
    {
      sdkret = bk_dma_flush_src_buffer(priv->dma);
      if (sdkret != BK_OK && result == 0)
        {
          result = bk7258_jpeg_encoder_sdk_error(sdkret);
        }
    }

  frame_size = bk_jpeg_enc_get_frame_size();
  if (priv->dma_started)
    {
      sdkret = bk_dma_stop(priv->dma);
      if (sdkret != BK_OK && result == 0)
        {
          result = bk7258_jpeg_encoder_sdk_error(sdkret);
        }
      priv->dma_started = false;
    }

  flags = spin_lock_irqsave(&priv->state_lock);
  callback_result = priv->callback_result;
  spin_unlock_irqrestore(&priv->state_lock, flags);

  if (callback_result != 0 && result == 0)
    {
      result = callback_result;
    }

  if (result == 0 && frame_size > priv->output_capacity)
    {
      result = -ENOSPC;
    }

  if (result != 0)
    {
      /* The official controller soft-resets JPEG before allowing a later
       * frame after any encode error.  Preserve the original error if the
       * recovery reset also fails, but fail closed on the next call. */
      sdkret = bk_jpeg_enc_soft_reset();
      if (sdkret != BK_OK)
        {
          priv->faulted = true;
        }
    }

  flags = spin_lock_irqsave(&priv->state_lock);
  priv->completion_result = result;
  priv->completion_done = true;
  priv->completion_queued = false;
  spin_unlock_irqrestore(&priv->state_lock, flags);
  (void)nxsem_post(&priv->complete_sem);
}

static int bk7258_jpeg_encoder_dma_config(
  FAR struct bk7258_jpeg_encoder_s *priv)
{
  dma_config_t config = {0};
  uint32_t fifo_addr;
  uint64_t cache_end;
  bk_err_t sdkret;

  sdkret = bk_jpeg_enc_get_fifo_addr(&fifo_addr);
  if (sdkret != BK_OK)
    {
      return bk7258_jpeg_encoder_sdk_error(sdkret);
    }

  cache_end = (uint64_t)(uintptr_t)priv->line_cache +
              priv->line_cache_size;
  config.mode = DMA_WORK_MODE_REPEAT;
  config.chan_prio = 0;
  config.src.dev = DMA_DEV_JPEG;
  config.src.width = DMA_DATA_WIDTH_32BITS;
  config.src.addr_inc_en = DMA_ADDR_INC_ENABLE;
  config.src.addr_loop_en = DMA_ADDR_LOOP_ENABLE;
  config.src.start_addr = fifo_addr;
  config.dst.dev = DMA_DEV_DTCM;
  config.dst.width = DMA_DATA_WIDTH_32BITS;
  config.dst.addr_inc_en = DMA_ADDR_INC_ENABLE;
  config.dst.addr_loop_en = DMA_ADDR_LOOP_ENABLE;
  config.dst.start_addr = (uint32_t)(uintptr_t)priv->line_cache;
  config.dst.end_addr = (uint32_t)cache_end;

  sdkret = bk_dma_init(priv->dma, &config);
  if (sdkret != BK_OK)
    {
      return bk7258_jpeg_encoder_sdk_error(sdkret);
    }

  priv->dma_ready = true;
  sdkret = bk_dma_set_transfer_len(priv->dma,
                                   BK7258_JPEG_ENCODER_DMA_BYTES);
  if (sdkret != BK_OK)
    {
      return bk7258_jpeg_encoder_sdk_error(sdkret);
    }

  /* Match the v3.1.1.9 secure-domain JPEG controller.  Without these
   * attributes BK7258 accepts the channel setup but drains only one FIFO
   * word, leaving an apparently valid JPEG frame length with no payload. */

  sdkret = bk_dma_set_src_burst_len(priv->dma, BURST_LEN_SINGLE);
  if (sdkret != BK_OK)
    {
      return bk7258_jpeg_encoder_sdk_error(sdkret);
    }

  sdkret = bk_dma_set_dest_burst_len(priv->dma, BURST_LEN_INC16);
  if (sdkret != BK_OK)
    {
      return bk7258_jpeg_encoder_sdk_error(sdkret);
    }

  sdkret = bk_dma_set_src_sec_attr(priv->dma, DMA_ATTR_SEC);
  if (sdkret != BK_OK)
    {
      return bk7258_jpeg_encoder_sdk_error(sdkret);
    }

  sdkret = bk_dma_set_dest_sec_attr(priv->dma, DMA_ATTR_SEC);
  if (sdkret != BK_OK)
    {
      return bk7258_jpeg_encoder_sdk_error(sdkret);
    }

  return 0;
}

static int bk7258_jpeg_encoder_register_callbacks(
  FAR struct bk7258_jpeg_encoder_s *priv)
{
  bk_err_t sdkret;

  /* Mark the set live before the first registration so every partial setup
   * failure takes the same unregister path. */
  priv->callbacks_ready = true;

  sdkret = bk_jpeg_enc_register_isr(JPEG_HEAD_OUTPUT,
                                    bk7258_jpeg_encoder_head_callback, priv);
  if (sdkret != BK_OK)
    {
      return bk7258_jpeg_encoder_sdk_error(sdkret);
    }

  sdkret = bk_jpeg_enc_register_isr(JPEG_LINE_CLEAR,
                                    bk7258_jpeg_encoder_line_callback, priv);
  if (sdkret != BK_OK)
    {
      return bk7258_jpeg_encoder_sdk_error(sdkret);
    }

  sdkret = bk_jpeg_enc_register_isr(JPEG_EOF,
                                    bk7258_jpeg_encoder_eof_callback, priv);
  if (sdkret != BK_OK)
    {
      return bk7258_jpeg_encoder_sdk_error(sdkret);
    }

  sdkret = bk_jpeg_enc_register_isr(JPEG_FRAME_ERR,
                                    bk7258_jpeg_encoder_error_callback, priv);
  if (sdkret != BK_OK)
    {
      return bk7258_jpeg_encoder_sdk_error(sdkret);
    }

