open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_jpeg_encoder.c
  return 0;
}

static void bk7258_jpeg_encoder_unregister_callbacks(
  FAR struct bk7258_jpeg_encoder_s *priv)
{
  if (priv->callbacks_ready)
    {
      (void)bk_jpeg_enc_unregister_isr(JPEG_HEAD_OUTPUT);
      (void)bk_jpeg_enc_unregister_isr(JPEG_LINE_CLEAR);
      (void)bk_jpeg_enc_unregister_isr(JPEG_EOF);
      (void)bk_jpeg_enc_unregister_isr(JPEG_FRAME_ERR);
      priv->callbacks_ready = false;
    }
}

static void bk7258_jpeg_encoder_cleanup_failed(
  FAR struct bk7258_jpeg_encoder_s *priv)
{
  if (priv->dma_started)
    {
      (void)bk_dma_stop(priv->dma);
      priv->dma_started = false;
    }

  work_cancel_sync(HPWORK, &priv->line_work);
  work_cancel_sync(HPWORK, &priv->complete_work);
  priv->operation_active = false;
  bk7258_jpeg_encoder_unregister_callbacks(priv);

  if (priv->jpeg_ready)
    {
      (void)bk_jpeg_enc_deinit();
      priv->jpeg_ready = false;
    }

  if (priv->yuv_ready)
    {
      (void)bk_yuv_buf_deinit();
      priv->yuv_ready = false;
    }

  if (priv->route_ready)
    {
      bk7258_jpeg_encoder_route_from_cpu1();
      priv->route_ready = false;
    }

  if (priv->dma_ready)
    {
      (void)bk_dma_deinit(priv->dma);
      priv->dma_ready = false;
    }

  if (priv->dma != DMA_ID_MAX)
    {
      (void)bk_dma_free(DMA_DEV_JPEG, priv->dma);
      priv->dma = DMA_ID_MAX;
    }

}

static int bk7258_jpeg_encoder_abort_locked(
  FAR struct bk7258_jpeg_encoder_s *priv, int reason)
{
  irqstate_t flags;
  int first_error = 0;
  bk_err_t sdkret;

  /* Stop workers before touching hardware so no deferred line callback can
   * race the timeout recovery sequence. */
  flags = spin_lock_irqsave(&priv->state_lock);
  priv->operation_active = false;
  priv->completion_queued = false;
  priv->head_pending = false;
  priv->pending_lines = 0;
  spin_unlock_irqrestore(&priv->state_lock, flags);

  work_cancel_sync(HPWORK, &priv->line_work);
  work_cancel_sync(HPWORK, &priv->complete_work);

  sdkret = bk_yuv_buf_stop(JPEG_MODE);
  if (sdkret != BK_OK && first_error == 0)
    {
      first_error = bk7258_jpeg_encoder_sdk_error(sdkret);
    }

  sdkret = bk_yuv_buf_soft_reset();
  if (sdkret != BK_OK && first_error == 0)
    {
      first_error = bk7258_jpeg_encoder_sdk_error(sdkret);
    }

  sdkret = bk_jpeg_enc_soft_reset();
  if (sdkret != BK_OK && first_error == 0)
    {
      first_error = bk7258_jpeg_encoder_sdk_error(sdkret);
    }

  if (priv->dma_started)
    {
      sdkret = bk_dma_stop(priv->dma);
      if (sdkret != BK_OK && first_error == 0)
        {
          first_error = bk7258_jpeg_encoder_sdk_error(sdkret);
        }
      priv->dma_started = false;
    }

  if (first_error < 0)
    {
      priv->faulted = true;
    }

  /* A lost IRQ must always be reported as a timeout; cleanup failures make
   * subsequent calls fail-closed through faulted, but do not hide it. */
  if (reason < 0)
    {
      return reason;
    }

  return first_error;
}

int bk7258_jpeg_encoder_initialize(
  FAR struct bk7258_jpeg_encoder_s **out,
  FAR const struct bk7258_jpeg_encoder_config_s *config)
{
  FAR struct bk7258_jpeg_encoder_s *priv = &g_bk7258_jpeg_encoder;
  yuv_buf_config_t yuv_config = {0};
  jpeg_config_t jpeg_config = {0};
  uint64_t frame_bytes;
  uint64_t block_bytes;
  int ret;
  bk_err_t sdkret;

  if (out == NULL || config == NULL)
    {
      return -EINVAL;
    }

  *out = NULL;
  if (config->width == 0 || config->height == 0 ||
      (config->width % BK7258_JPEG_ENCODER_FLEXA_LINES) != 0 ||
      (config->height % BK7258_JPEG_ENCODER_FLEXA_LINES) != 0 ||
      config->format > BK7258_JPEG_ENCODER_UVYY)
    {
      return -EINVAL;
    }

  frame_bytes = (uint64_t)config->width * config->height *
                BK7258_JPEG_ENCODER_PIXEL_BYTES;
  block_bytes = (uint64_t)config->width *
                BK7258_JPEG_ENCODER_FLEXA_LINES *
                BK7258_JPEG_ENCODER_PIXEL_BYTES;
  if (frame_bytes > UINT32_MAX || block_bytes > UINT32_MAX ||
      block_bytes * 2 > config->line_cache_size ||
      config->line_cache_size == 0 ||
      ((uintptr_t)config->line_cache & 3u) != 0)
    {
      return -EINVAL;
    }

  ret = bk7258_jpeg_encoder_validate_range(config->line_cache,
                                           config->line_cache_size, true);
  if (ret < 0)
    {
      return ret;
    }

  ret = nxmutex_lock(&priv->api_lock);
  if (ret < 0)
    {
      return ret;
    }

  if (priv->initialized)
    {
      nxmutex_unlock(&priv->api_lock);
      return -EBUSY;
    }

  priv->faulted = false;
  priv->dma_ready = false;
  priv->jpeg_ready = false;
  priv->yuv_ready = false;
  priv->callbacks_ready = false;
  priv->route_ready = false;
  priv->dma_started = false;
  priv->operation_active = false;
  priv->completion_queued = false;
  priv->completion_done = false;
  priv->head_pending = false;
  priv->pending_lines = 0;
  priv->callback_result = 0;
  priv->completion_result = -EIO;
  priv->input = NULL;
  priv->output = NULL;
  priv->input_length = 0;
  priv->output_capacity = 0;
  priv->line_work = (struct work_s){0};
  priv->complete_work = (struct work_s){0};
  spin_lock_init(&priv->state_lock);
  while (nxsem_trywait(&priv->complete_sem) == 0)
    {
    }
  priv->dma = DMA_ID_MAX;
  priv->width = config->width;
  priv->height = config->height;
  priv->format = (yuv_format_t)config->format;
  priv->line_cache = config->line_cache;
  priv->line_cache_size = config->line_cache_size;
  priv->block_bytes = (uint32_t)block_bytes;
  priv->block_count = config->height / BK7258_JPEG_ENCODER_FLEXA_LINES;

  ret = bk7258_media_root_initialize(BK7258_MEDIA_ROOT_JPEG);
  if (ret < 0)
    {
      goto fail;
    }

  priv->dma = bk_fixed_dma_alloc(DMA_DEV_JPEG, BK7258_JPEG_ENCODER_DMA_CHANNEL);
  if (priv->dma == DMA_ID_MAX)
    {
      ret = -EBUSY;
      goto fail;
    }

  yuv_config.work_mode = JPEG_MODE;
  yuv_config.mclk_div = YUV_MCLK_DIV_4;
  yuv_config.x_pixel = config->width / BK7258_JPEG_ENCODER_FLEXA_LINES;
  yuv_config.y_pixel = config->height / BK7258_JPEG_ENCODER_FLEXA_LINES;
  yuv_config.yuv_mode_cfg.yuv_format = priv->format;
  yuv_config.yuv_mode_cfg.vsync = SYNC_HIGH_LEVEL;
  yuv_config.yuv_mode_cfg.hsync = SYNC_HIGH_LEVEL;
  yuv_config.base_addr = config->line_cache;
  yuv_config.emr_base_addr = config->line_cache;
  sdkret = bk_yuv_buf_init(&yuv_config);
  ret = bk7258_jpeg_encoder_sdk_error(sdkret);
  if (ret < 0)
    {
      goto fail;
    }
  priv->yuv_ready = true;

  sdkret = bk_yuv_buf_enable_nosensor_encode_mode();
  ret = bk7258_jpeg_encoder_sdk_error(sdkret);
  if (ret < 0)
    {
      goto fail;
    }

  jpeg_config.mode = JPEG_MODE;
  jpeg_config.sensor_fmt = priv->format;
  jpeg_config.x_pixel = yuv_config.x_pixel;
  jpeg_config.y_pixel = yuv_config.y_pixel;
  sdkret = bk_jpeg_enc_init(&jpeg_config);
  ret = bk7258_jpeg_encoder_sdk_error(sdkret);
  if (ret < 0)
    {
      goto fail;
    }
  priv->jpeg_ready = true;

  sdkret = bk_jpeg_enc_yuv_fmt_sel(priv->format);
  ret = bk7258_jpeg_encoder_sdk_error(sdkret);
  if (ret < 0)
    {
      goto fail;
    }

  ret = bk7258_jpeg_encoder_route_to_cpu1();
  if (ret < 0)
    {
      goto fail;
    }
  priv->route_ready = true;

