open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_jpeg_encoder.c
  ret = bk7258_jpeg_encoder_dma_config(priv);
  if (ret < 0)
    {
      goto fail;
    }

  ret = bk7258_jpeg_encoder_register_callbacks(priv);
  if (ret < 0)
    {
      goto fail;
    }

  priv->initialized = true;
  *out = priv;
  nxmutex_unlock(&priv->api_lock);
  return 0;

  fail:
  bk7258_jpeg_encoder_cleanup_failed(priv);
  priv->initialized = false;
  priv->faulted = false;
  priv->line_cache = NULL;
  priv->line_cache_size = 0;
  priv->input = NULL;
  priv->output = NULL;
  priv->input_length = 0;
  priv->output_capacity = 0;
  priv->dma = DMA_ID_MAX;
  nxmutex_unlock(&priv->api_lock);
  return ret;
}

int bk7258_jpeg_encoder_uninitialize(
  FAR struct bk7258_jpeg_encoder_s *priv)
{
  int ret;
  int first_error = 0;
  bk_err_t sdkret;

  if (priv != &g_bk7258_jpeg_encoder)
    {
      return -EINVAL;
    }

  ret = nxmutex_lock(&priv->api_lock);
  if (ret < 0)
    {
      return ret;
    }

  if (!priv->initialized)
    {
      nxmutex_unlock(&priv->api_lock);
      return -EINVAL;
    }

  if (priv->operation_active)
    {
      nxmutex_unlock(&priv->api_lock);
      return -EBUSY;
    }

  priv->operation_active = false;
  bk7258_jpeg_encoder_unregister_callbacks(priv);
  work_cancel_sync(HPWORK, &priv->line_work);
  work_cancel_sync(HPWORK, &priv->complete_work);

  if (priv->dma_started)
    {
      sdkret = bk_dma_stop(priv->dma);
      ret = bk7258_jpeg_encoder_sdk_error(sdkret);
      if (ret < 0 && first_error == 0)
        {
          first_error = ret;
        }
      priv->dma_started = false;
    }

  if (priv->jpeg_ready)
    {
      sdkret = bk_jpeg_enc_deinit();
      ret = bk7258_jpeg_encoder_sdk_error(sdkret);
      if (ret < 0 && first_error == 0)
        {
          first_error = ret;
        }
      if (ret >= 0)
        {
          priv->jpeg_ready = false;
        }
    }

  if (priv->yuv_ready)
    {
      sdkret = bk_yuv_buf_deinit();
      ret = bk7258_jpeg_encoder_sdk_error(sdkret);
      if (ret < 0 && first_error == 0)
        {
          first_error = ret;
        }
      if (ret >= 0)
        {
          priv->yuv_ready = false;
        }
    }

  if (priv->route_ready)
    {
      bk7258_jpeg_encoder_route_from_cpu1();
      priv->route_ready = false;
    }

  if (priv->dma_ready)
    {
      sdkret = bk_dma_deinit(priv->dma);
      ret = bk7258_jpeg_encoder_sdk_error(sdkret);
      if (ret < 0 && first_error == 0)
        {
          first_error = ret;
        }
      if (ret >= 0)
        {
          priv->dma_ready = false;
        }
    }

  if (!priv->dma_ready && priv->dma != DMA_ID_MAX)
    {
      sdkret = bk_dma_free(DMA_DEV_JPEG, priv->dma);
      ret = bk7258_jpeg_encoder_sdk_error(sdkret);
      if (ret < 0 && first_error == 0)
        {
          first_error = ret;
        }
      if (ret >= 0)
        {
          priv->dma = DMA_ID_MAX;
        }
    }

  if (priv->yuv_ready || priv->jpeg_ready || priv->dma_ready)
    {
      priv->faulted = true;
      nxmutex_unlock(&priv->api_lock);
      return first_error < 0 ? first_error : -EIO;
    }

  priv->initialized = false;
  priv->faulted = false;
  nxmutex_unlock(&priv->api_lock);
  return first_error;
}

int bk7258_jpeg_encoder_set_compression(
  FAR struct bk7258_jpeg_encoder_s *priv,
  uint32_t min_size,
  uint32_t max_size)
{
  int ret;
  bk_err_t sdkret;

  if (priv != &g_bk7258_jpeg_encoder || min_size == 0 ||
      min_size >= max_size || max_size > UINT16_MAX)
    {
      return -EINVAL;
    }

  ret = nxmutex_lock(&priv->api_lock);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_jpeg_encoder_check_handle(priv);
  if (ret < 0 || priv->operation_active)
    {
      if (ret >= 0)
        {
          ret = -EBUSY;
        }
      nxmutex_unlock(&priv->api_lock);
      return ret;
    }

  sdkret = bk_jpeg_enc_encode_config(1, max_size, min_size);
  ret = bk7258_jpeg_encoder_sdk_error(sdkret);
  nxmutex_unlock(&priv->api_lock);
  return ret;
}

int bk7258_jpeg_encoder_encode(
  FAR struct bk7258_jpeg_encoder_s *priv,
  FAR const struct bk7258_jpeg_encoder_input_s *input,
  FAR struct bk7258_jpeg_encoder_output_s *output)
{
  uint64_t frame_bytes;
  uint32_t first_bytes;
  uint32_t second_bytes;
  irqstate_t flags;
  bk_err_t sdkret;
  int ret;

  if (priv != &g_bk7258_jpeg_encoder || input == NULL || output == NULL ||
      input->data == NULL || output->data == NULL || output->capacity == 0 ||
      (output->capacity & 3u) != 0 ||
      ((uintptr_t)output->data & 3u) != 0)
    {
      return -EINVAL;
    }

  frame_bytes = (uint64_t)priv->width * priv->height *
                BK7258_JPEG_ENCODER_PIXEL_BYTES;
  if (input->length < frame_bytes)
    {
      return -EINVAL;
    }

  ret = bk7258_jpeg_encoder_validate_range(input->data, input->length,
                                           false);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_jpeg_encoder_validate_range(output->data, output->capacity,
                                           true);
  if (ret < 0)
    {
      return ret;
    }

  if (bk7258_jpeg_encoder_overlap(input->data, (uint32_t)frame_bytes,
                                  output->data, output->capacity) ||
      bk7258_jpeg_encoder_overlap(input->data, (uint32_t)frame_bytes,
                                  priv->line_cache, priv->line_cache_size) ||
      bk7258_jpeg_encoder_overlap(output->data, output->capacity,
                                  priv->line_cache, priv->line_cache_size))
    {
      return -EINVAL;
    }

  ret = nxmutex_lock(&priv->api_lock);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_jpeg_encoder_check_handle(priv);
  if (ret < 0)
    {
      goto unlock;
    }

  if (priv->operation_active)
    {
      ret = -EBUSY;
      goto unlock;
    }

  first_bytes = priv->block_bytes;
  second_bytes = priv->block_count > 1 ? priv->block_bytes : 0;
  memcpy(priv->line_cache, input->data, first_bytes);
  if (second_bytes != 0)
    {
      memcpy(priv->line_cache + priv->block_bytes,
             input->data + priv->block_bytes, second_bytes);
    }

  sdkret = bk_dma_set_dest_addr(priv->dma,
                                (uint32_t)(uintptr_t)output->data,
                                (uint32_t)((uintptr_t)output->data +
                                           output->capacity));
  ret = bk7258_jpeg_encoder_sdk_error(sdkret);
  if (ret < 0)
    {
      goto unlock;
    }

  while (nxsem_trywait(&priv->complete_sem) == 0)
    {
    }

