open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_jpeg_encoder.c
  flags = spin_lock_irqsave(&priv->state_lock);
  priv->input = input->data;
  priv->input_length = (uint32_t)frame_bytes;
  priv->output = output->data;
  priv->output_capacity = output->capacity;
  priv->next_block = priv->block_count > 2 ? 2 : priv->block_count;
  priv->pending_lines = 0;
  priv->callback_result = 0;
  priv->completion_result = -EIO;
  priv->completion_done = false;
  priv->head_pending = false;
  priv->completion_queued = false;
  priv->operation_active = true;
  spin_unlock_irqrestore(&priv->state_lock, flags);

  sdkret = bk_dma_start(priv->dma);
  ret = bk7258_jpeg_encoder_sdk_error(sdkret);
  if (ret < 0)
    {
      flags = spin_lock_irqsave(&priv->state_lock);
      priv->operation_active = false;
      spin_unlock_irqrestore(&priv->state_lock, flags);
      goto unlock;
    }
  priv->dma_started = true;

  sdkret = bk_yuv_buf_start(JPEG_MODE);
  ret = bk7258_jpeg_encoder_sdk_error(sdkret);
  if (ret < 0)
    {
      (void)bk_dma_stop(priv->dma);
      priv->dma_started = false;
      flags = spin_lock_irqsave(&priv->state_lock);
      priv->operation_active = false;
      spin_unlock_irqrestore(&priv->state_lock, flags);
      goto unlock;
    }

  ret = nxsem_tickwait_uninterruptible(&priv->complete_sem,
                                       BK7258_JPEG_ENCODER_TIMEOUT_TICKS);
  if (ret < 0)
    {
      ret = bk7258_jpeg_encoder_abort_locked(priv, ret);
      goto unlock;
    }

  work_cancel_sync(HPWORK, &priv->line_work);
  flags = spin_lock_irqsave(&priv->state_lock);
  ret = priv->completion_result;
  bool completion_done = priv->completion_done;
  if (!completion_done && ret >= 0)
    {
      ret = -EIO;
    }
  priv->operation_active = false;
  spin_unlock_irqrestore(&priv->state_lock, flags);

  if (!completion_done)
    {
      /* The completion work could not be queued.  Its synchronous caller
       * owns the only safe fallback stop and reset path. */
      ret = bk7258_jpeg_encoder_abort_locked(priv, -EIO);
    }

  if (ret == 0)
    {
      output->length = bk_jpeg_enc_get_frame_size();
      if (output->length == 0)
        {
          ret = -EIO;
        }
    }

unlock:
  nxmutex_unlock(&priv->api_lock);
  return ret;
}
